---
kind: property
id: P:Autodesk.Revit.DB.ExportLineweightInfo.DestinationLineweightName
source: html/ae7cd0da-d489-2e37-d84e-fac0827dbe23.htm
---
# Autodesk.Revit.DB.ExportLineweightInfo.DestinationLineweightName Property

The destination lineweight name (the name of the line weight in the exported format)

## Syntax (C#)
```csharp
public string DestinationLineweightName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null